particle-iot/device-os/hal/src/rtl872x/i2c_hal.cpp
    int end() {
        if (isEnabled()) {
            if (i2cInitStruct_.I2CMaster == I2C_SLAVE_MODE) {
                InterruptDis(I2C0_IRQ_LP);
	            InterruptUnRegister(I2C0_IRQ_LP);
                I2C_INTConfig(i2cDev_, (BIT_IC_INTR_MASK_M_START_DET | BIT_IC_INTR_MASK_M_RX_FULL | BIT_IC_INTR_MASK_M_STOP_DET | 
                                        BIT_IC_INTR_MASK_M_RD_REQ | BIT_IC_INTR_MASK_M_RX_DONE), DISABLE);
            }
            I2C_Cmd(i2cDev_, DISABLE);
            state_ = HAL_I2C_STATE_DISABLED;
            // RCC_PeriphClockCmd(APBPeriph_I2C0, APBPeriph_I2C0_CLOCK, DISABLE);
            Pinmux_Config(hal_pin_to_rtl_pin(sdaPin_), PINMUX_FUNCTION_GPIO);
            Pinmux_Config(hal_pin_to_rtl_pin(sclPin_), PINMUX_FUNCTION_GPIO);
        }
        return SYSTEM_ERROR_NONE;
    }

    void reset() {
        end();

        // Just in case make sure that the pins are correctly configured (they should anyway be at this point)
        hal_gpio_config_t conf = {};
        conf.size = sizeof(conf);
        conf.version = HAL_GPIO_VERSION;
        conf.mode = OUTPUT_OPEN_DRAIN_PULLUP;
        conf.set_value = true;
        conf.value = 1;
        hal_gpio_configure(sdaPin_, &conf, nullptr);
        conf.value = hal_gpio_read(sclPin_);
        hal_gpio_configure(sclPin_, &conf, nullptr);

        // Generate up to 9 pulses on SCL to tell slave to release the bus
        for (int i = 0; i < 9; i++) {
            hal_gpio_write(sdaPin_, 1);
            HAL_Delay_Microseconds(50);

            if (hal_gpio_read(sdaPin_) == 0) {
                hal_gpio_write(sclPin_, 0);
                HAL_Delay_Microseconds(50);
                hal_gpio_write(sclPin_, 1);
                HAL_Delay_Microseconds(50);
                hal_gpio_write(sclPin_, 0);
                HAL_Delay_Microseconds(50);
            } else {
                break;
            }
        }

        // Generate STOP condition: pull SDA low, switch to high
        hal_gpio_write(sdaPin_, 0);
        HAL_Delay_Microseconds(50);
        hal_gpio_write(sclPin_, 1);
        HAL_Delay_Microseconds(50);
        hal_gpio_write(sdaPin_, 1);
        HAL_Delay_Microseconds(50);

        hal_pin_set_function(sdaPin_, PF_I2C);
        hal_pin_set_function(sclPin_, PF_I2C);

        hal_i2c_mode_t mode = (i2cInitStruct_.I2CMaster  == I2C_MASTER_MODE) ? I2C_MODE_MASTER : I2C_MODE_SLAVE;
        begin(mode, i2cInitStruct_.I2CAckAddr);
    }

    int setSpeed(uint32_t speed) {
        bool enabled = isEnabled();
        if (enabled) {
            I2C_Cmd(i2cDev_, DISABLE);
            state_ = HAL_I2C_STATE_DISABLED;
        }
        i2cInitStruct_.I2CSpdMod = ((speed == CLOCK_SPEED_100KHZ) ? I2C_SS_MODE : I2C_FS_MODE);
        i2cInitStruct_.I2CClk    = ((speed == CLOCK_SPEED_100KHZ) ? 100 : 400);
        if (enabled) {
            I2C_Init(i2cDev_, &i2cInitStruct_);
            I2C_Cmd(i2cDev_, ENABLE);
            state_ = HAL_I2C_STATE_ENABLED;
        }
        return SYSTEM_ERROR_NONE;
    }

    int setAddress(uint8_t address) {
        if (i2cInitStruct_.I2CAckAddr != address) {
            bool enabled = isEnabled();
            if (enabled) {
                I2C_Cmd(i2cDev_, DISABLE);
                state_ = HAL_I2C_STATE_DISABLED;
            }
            i2cInitStruct_.I2CAckAddr = address;
            if (enabled) {
                I2C_Init(i2cDev_, &i2cInitStruct_);
                I2C_Cmd(i2cDev_, ENABLE);
                state_ = HAL_I2C_STATE_ENABLED;
            }
        }
        return SYSTEM_ERROR_NONE;
    }

    ssize_t requestFrom(const hal_i2c_transmission_config_t* config) {
        if (i2cInitStruct_.I2CMaster != I2C_MASTER_MODE) {
            return 0;
        }
        rxBuffer_.reset();
        uint32_t quantity = std::min((size_t)config->quantity, rxBuffer_.size());

        setAddress(config->address);

        for (uint32_t i = 0; i < quantity; i++) {
            if(i >= quantity - 1) {
                if (config->flags & HAL_I2C_TRANSMISSION_FLAG_STOP) {
                    // Generate stop signal
                    i2cDev_->IC_DATA_CMD = 0x0003 << 8;
                } else {
                    // Generate restart signal
                    i2cDev_->IC_DATA_CMD = 0x0005 << 8;
                }
            } else {
                i2cDev_->IC_DATA_CMD = 0x0001 << 8;
            }
            // Wait for I2C_FLAG_RFNE flag
            if (WAIT_TIMED_ROUTINE(config->timeout_ms, I2C_CheckFlagState(i2cDev_, BIT_IC_STATUS_RFNE) == 0, checkAbrt) < 0) {
                reset();
                goto ret;
            }
            if(checkAbrt()) {
                LOG(TRACE, "Abort: %08X", i2cDev_->IC_TX_ABRT_SOURCE);
                I2C_ClearAllINT(i2cDev_);
                goto ret;
            }
            rxBuffer_.put((uint8_t)i2cDev_->IC_DATA_CMD);
        }
    ret:
        return rxBuffer_.data();
    }

    ssize_t available() {
        return rxBuffer_.data();
    }

    uint8_t read() {
        uint8_t data = 0xFF;
        if (rxBuffer_.get(&data) != 1) {
            return 0xFF;
        }
        return data;
    }

    uint8_t peek() {
        uint8_t data = 0xFF;
        if (rxBuffer_.peek(&data) != 1) {
            return 0xFF;
        }
        return data;
    }

    void setConfigOrDefault(const hal_i2c_transmission_config_t* config, uint8_t address) {
        memset(&transConfig_, 0, sizeof(transConfig_));
        if (config) {
            memcpy(&transConfig_, config, std::min((size_t)config->size, sizeof(transConfig_)));
        } else {
            transConfig_ = {
                .size = sizeof(hal_i2c_transmission_config_t),
                .version = 0,
                .address = address,
                .reserved = {0},
                .quantity = 0,
                .timeout_ms = HAL_I2C_DEFAULT_TIMEOUT_MS,
                .flags = HAL_I2C_TRANSMISSION_FLAG_STOP
            };
        }
    }

    ssize_t write(uint8_t data) {
        txBuffer_.put(data);
        return 1;
    }

    int endTransmission(uint8_t stop) {
        /* 0: success
         * 1: busy timeout upon entering endTransmission()
         * 2: START bit generation timeout
         * 3: end of address transmission timeout
         * 4: data byte transfer timeout
         * 5: data byte transfer succeeded, busy timeout immediately after
         * 6: timeout waiting for peripheral to clear stop bit*/
        if (i2cInitStruct_.I2CMaster != I2C_MASTER_MODE) {
            return 7;
        }

        setAddress(transConfig_.address);

        uint32_t quantity = txBuffer_.data();
        for (uint32_t i = 0; i < quantity; i++) {
            if (!WAIT_TIMED(transConfig_.timeout_ms, I2C_CheckFlagState(i2cDev_, BIT_IC_STATUS_TFNF) == 0)) {
                reset();
                return 1;
            }
            uint8_t data = 0xFF;
            if (txBuffer_.get(&data) != 1) {
                return 8;
            }
            if(i >= quantity - 1) {
                if (stop) {
                    // Generate stop signal
                    i2cDev_->IC_DATA_CMD = data | (1 << 9);
                } else {
                    // Generate restart signal
                    i2cDev_->IC_DATA_CMD = data | (1 << 10);
                }
            } else {
                // The address will be sent before sending the first data byte
                i2cDev_->IC_DATA_CMD = data;
            }
            if (WAIT_TIMED_ROUTINE(transConfig_.timeout_ms, I2C_CheckFlagState(i2cDev_, BIT_IC_STATUS_TFE) == 0, checkAbrt) < 0) {
                reset();
                return 4;
            }
            if(checkAbrt()) {
                LOG(TRACE, "Abort: %08X", i2cDev_->IC_TX_ABRT_SOURCE);
                I2C_ClearAllINT(i2cDev_);
                return 4;
            }
        }
        return 0;
    }

    void flush() {
        txBuffer_.reset();
        rxBuffer_.reset();
    }

    void setOnRequestedCallback(void (*function)(void)) {
        onRequested_ = function;
    }

